RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_power.c
    return (kPOWER_Status_Success);
}

/**
 * brief
 * return
 */
power_sram_pwr_mode_t POWER_GetSRAMPowerMode(power_sram_index_t sram_index)
{
    power_sram_pwr_mode_t pwr_mode;
    uint32_t state;
    uint32_t sram_ctrl_0 = PMC->SRAMCTRL0;
    uint32_t sram_ctrl_1 = PMC->SRAMCTRL1;

    switch (sram_index)
    {
        case kPOWER_SRAM_IDX_RAM_X0:
        {
            state = (sram_ctrl_0 >> PMC_SRAMCTRL0_RAM_X0_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_00:
        {
            state = (sram_ctrl_0 >> PMC_SRAMCTRL0_RAM_00_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_01:
        {
            state = (sram_ctrl_0 >> PMC_SRAMCTRL0_RAM_01_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_02:
        {
            state = (sram_ctrl_0 >> PMC_SRAMCTRL0_RAM_02_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_03:
        {
            state = (sram_ctrl_0 >> PMC_SRAMCTRL0_RAM_03_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_10:
        {
            state = (sram_ctrl_0 >> PMC_SRAMCTRL0_RAM_10_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_20:
        {
            state = (sram_ctrl_0 >> PMC_SRAMCTRL0_RAM_20_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_30:
        {
            state = (sram_ctrl_0 >> PMC_SRAMCTRL0_RAM_30_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_40:
        {
            state = (sram_ctrl_1 >> PMC_SRAMCTRL1_RAM_40_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_41:
        {
            state = (sram_ctrl_1 >> PMC_SRAMCTRL1_RAM_41_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_42:
        {
            state = (sram_ctrl_1 >> PMC_SRAMCTRL1_RAM_42_LS_SHIFT) & 0xF;
            break;
        }

        case kPOWER_SRAM_IDX_RAM_43:
        {
            state = (sram_ctrl_1 >> PMC_SRAMCTRL1_RAM_43_LS_SHIFT) & 0xF;
            break;
        }

        default:
            // Error
            state = 0x6; // Active.
    }

    switch (state)
    {
        case 0x6:
            pwr_mode = kPOWER_SRAMPwrActive;
            break;

        case 0xF:
            pwr_mode = kPOWER_SRAMPwrLightSleep;
            break;

        case 0x8:
            pwr_mode = kPOWER_SRAMPwrDeepSleep;
            break;

        case 0x9:
            pwr_mode = kPOWER_SRAMPwrShutDown;
            break;

        default:
            pwr_mode = kPOWER_SRAMPwrActive;
    }

    return (pwr_mode);
}

/**
 * brief
 * return
 */
power_status_t POWER_SRAMPowerModeControl(power_sram_bit_t sram_inst, power_sram_pwr_mode_t pwr_mode)
{
    power_sram_pwr_mode_t current_pwr_mode;
    power_sram_index_t sram_index = kPOWER_SRAM_IDX_RAM_X0;

    sram_inst = (power_sram_bit_t)((uint32_t)sram_inst & 0x3FFF); /* Only SRAM from RAM_X0 to RAM_F3 */
    while ((uint32_t)sram_inst != 0)
    {
        // There is a least 1 SRAM instance to be processed
        if ((uint32_t)sram_inst & 0x1)
        {
            // Get current SRAM state
            current_pwr_mode = POWER_GetSRAMPowerMode(sram_index);

            // The SRAM instance Power state must be updated
            switch (current_pwr_mode)
            {
                case kPOWER_SRAMPwrActive:
                { // Active
                    switch (pwr_mode)
                    {
                        case kPOWER_SRAMPwrActive:
                        { // Active ---> Active : there is nothing to do.
                            break;
                        }

                        case kPOWER_SRAMPwrLightSleep:
                        { // Active ---> Light Sleep
                            POWER_SRAMActiveToLightSleep(sram_index);
                            break;
                        }

                        case kPOWER_SRAMPwrDeepSleep:
                        { // Active ---> Deep Sleep
                            POWER_SRAMActiveToDeepSleep(sram_index);
                            break;
                        }

                        case kPOWER_SRAMPwrShutDown:
                        { // Active ---> Shut Down
                            POWER_SRAMActiveToShutDown(sram_index);
                            break;
                        }

                        default:
                            // Do nothing.
                            ;
                    } // switch( pwr_mode )

                    break;
                }

                case kPOWER_SRAMPwrLightSleep:
                { // Light Sleep
                    switch (pwr_mode)
                    {
                        case kPOWER_SRAMPwrActive:
                        { // Light Sleep ---> Active
                            POWER_SRAMLightSleepToActive(sram_index);
                            break;
                        }

                        case kPOWER_SRAMPwrLightSleep:
                        { // Light Sleep ---> Light Sleep : there is nothing to do.
                            break;
                        }

                        default:
                            // Light Sleep ---> Shut Down : FORBIDDEN (error)
                            // Light Sleep ---> Deep Sleep : FORBIDDEN (error)
                            return (kPOWER_Status_Fail);
                    } // switch( pwr_mode )

                    break;
                }

                case kPOWER_SRAMPwrDeepSleep:
                { // Deep Sleep
                    switch (pwr_mode)
                    {
                        case kPOWER_SRAMPwrActive:
                        { // Deep Sleep ---> Active
                            POWER_SRAMDeepSleepToActive(sram_index);
                            break;
                        }

                        case kPOWER_SRAMPwrDeepSleep:
                        { // Deep Sleep ---> Deep Sleep : there is nothing to do.
                            break;
                        }

                        default:
                            // Deep Sleep ---> Shut Down : FORBIDDEN (error)
                            // Deep Sleep ---> Light Sleep : FORBIDDEN (error)
                            return (kPOWER_Status_Fail);
                    } // switch( pwr_mode )

                    break;
                }

                case kPOWER_SRAMPwrShutDown:
                { // Shutdown
                    switch (pwr_mode)
                    {
                        case kPOWER_SRAMPwrActive:
                        { // Shutdown ---> Active
                            POWER_SRAMShutDownToActive(sram_index);
                            break;
                        }

                        case kPOWER_SRAMPwrShutDown:
                        { // Shutdown ---> Shut Down : there is nothing to do.
                            break;
                        }

                        default:
                            // Shutdown ---> Deep Sleep : FORBIDDEN (error)
                            // Shutdown ---> Light Sleep : FORBIDDEN (error)
                            return (kPOWER_Status_Fail);
                    } // switch( pwr_mode )

                    break;
                }

                default:
                    // Do nothing
                    ;
            } // switch( current_pwr_mode )
        }     // if ( (uint32_t)sram_inst & 0x1 )

