RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_power.c
    if ((cpu_retention_addr >= RAM_00_CPU_RET_ADDR_MIN) && (cpu_retention_addr <= RAM_00_CPU_RET_ADDR_MAX))
    {
        // Inside RAM_00
        sram_retention_ctrl |= kPOWER_SRAM_RAM_00;
    }
    else
    {
        if ((cpu_retention_addr >= RAM_01_CPU_RET_ADDR_MIN) && (cpu_retention_addr <= RAM_01_CPU_RET_ADDR_MAX))
        {
            // Inside RAM_01
            sram_retention_ctrl |= kPOWER_SRAM_RAM_01;
        }
        else
        {
            if ((cpu_retention_addr >= RAM_02_CPU_RET_ADDR_MIN) && (cpu_retention_addr <= RAM_02_CPU_RET_ADDR_MAX))
            {
                // Inside RAM_02
                sram_retention_ctrl |= kPOWER_SRAM_RAM_02;
            }
            else
            {
                if ((cpu_retention_addr >= RAM_03_CPU_RET_ADDR_MIN) && (cpu_retention_addr <= RAM_03_CPU_RET_ADDR_MAX))
                {
                    // Inside RAM_03
                    sram_retention_ctrl |= kPOWER_SRAM_RAM_03;
                }
                else
                {
                    // Error! Therefore, we locate the retention area in RAM_00
                    cpu_retention_addr = 0x20000000UL;
                    sram_retention_ctrl |= kPOWER_SRAM_RAM_00;
                }
            }
        }
    }

    lv_low_power_mode_cfg.SRAMRETCTRL = sram_retention_ctrl & kPOWER_SRAM_PDWN_MASK;

    // Voltage control in Low Power Modes
    // The Memories Voltage settings below are for voltage scaling
    lv_low_power_mode_cfg.VOLTAGE = POWER_SetLdoAoLdoMemVoltage(LOWPOWER_CFG_LPMODE_POWERDOWN);

    /* CPU0 retention Address */
    lv_low_power_mode_cfg.CPURETCTRL = ((cpu_retention_addr >> 1) | LOWPOWER_CPURETCTRL_ENA_MASK) &
                                       (LOWPOWER_CPURETCTRL_MEMBASE_MASK | LOWPOWER_CPURETCTRL_ENA_MASK);

    /* CPU Wake up & Interrupt sources control */
    lv_low_power_mode_cfg.WAKEUPSRC[0] = lv_low_power_mode_cfg.WAKEUPINT[0] =
        wakeup_interrupts[0] & (WAKEUP_GPIO_GLOBALINT0 | WAKEUP_GPIO_GLOBALINT1 | WAKEUP_FLEXCOMM3 | WAKEUP_ACMP |
                                WAKEUP_RTC_ALARM_WAKEUP | WAKEUP_WAKEUP_MAILBOX);
    lv_low_power_mode_cfg.WAKEUPSRC[1] = lv_low_power_mode_cfg.WAKEUPINT[1] =
        wakeup_interrupts[1] & WAKEUP_OS_EVENT_TIMER;
    lv_low_power_mode_cfg.WAKEUPSRC[2] = lv_low_power_mode_cfg.WAKEUPINT[2] = 0UL;
    lv_low_power_mode_cfg.WAKEUPSRC[3] = lv_low_power_mode_cfg.WAKEUPINT[3] = wakeup_interrupts[3] & WAKEUP_ITRC;

    /* Enter low power mode */
    POWER_SetLowPowerMode(&lv_low_power_mode_cfg);
}

/**
 * brief    PMC Deep Power-Down function call
 * return   nothing
 */
void POWER_EnterDeepPowerDown(uint32_t exclude_from_pd[1],
                              uint32_t sram_retention_ctrl,
                              uint32_t wakeup_interrupts[2],
                              uint32_t wakeup_io_ctrl)
{
    LPC_LOWPOWER_T lv_low_power_mode_cfg; /* Low Power Mode configuration structure */

    // Clear Low Power Mode configuration variable
    memset(&lv_low_power_mode_cfg, 0x0, sizeof(LPC_LOWPOWER_T));

    // Configure Low Power Mode configuration variable : DEEP POWER-DOWN mode
    lv_low_power_mode_cfg.CFG = LOWPOWER_CFG_LPMODE_DEEPPOWERDOWN << LOWPOWER_CFG_LPMODE_INDEX;

    // Note: only FRO32K, XTAL32K, FRO1M and LDO_MEM can stay powered during DEEP POWER-DOWN
    lv_low_power_mode_cfg.PDCTRL[0] = ~exclude_from_pd[0];
    lv_low_power_mode_cfg.PDCTRL[1] = 0xFFFFFFFF;

    // SRAM retention control during DEEP POWER-DOWN
    // RAM_X0, RAM_02 and RAM_03 excluded: they are used by ROM Boot code
    sram_retention_ctrl               = sram_retention_ctrl & kPOWER_SRAM_DPWD_MASK;
    lv_low_power_mode_cfg.SRAMRETCTRL = sram_retention_ctrl;

    // Sanity check: if retention is required for any SRAM instance other than RAM_00, make sure LDO MEM will stay
    // powered */
    if ((sram_retention_ctrl & (~kPOWER_SRAM_RAM_00)) != 0)
    {
        // SRAM retention is required : enable LDO_MEM
        lv_low_power_mode_cfg.PDCTRL[0] &= ~kPDRUNCFG_PD_LDOMEM;
    }
    else
    {
        // No SRAM retention required : disable LDO_MEM
        lv_low_power_mode_cfg.PDCTRL[0] |= kPDRUNCFG_PD_LDOMEM;
    }

    // Voltage control in Low Power Modes
    // The Memories Voltage settings below are for voltage scaling
    lv_low_power_mode_cfg.VOLTAGE = POWER_SetLdoAoLdoMemVoltage(LOWPOWER_CFG_LPMODE_DEEPPOWERDOWN);

    // Wake up sources control
    lv_low_power_mode_cfg.WAKEUPSRC[0] = lv_low_power_mode_cfg.WAKEUPINT[0] =
        wakeup_interrupts[0] &
        WAKEUP_RTC_ALARM_WAKEUP; /* CPU Wake up sources control : only WAKEUP_RTC_LITE_ALARM_WAKEUP */
    lv_low_power_mode_cfg.WAKEUPSRC[1] = lv_low_power_mode_cfg.WAKEUPINT[1] =
        wakeup_interrupts[1] & WAKEUP_OS_EVENT_TIMER; /* CPU Wake up sources control : only WAKEUP_OS_EVENT_TIMER */
    lv_low_power_mode_cfg.WAKEUPSRC[2] = lv_low_power_mode_cfg.WAKEUPINT[2] = 0UL;
    lv_low_power_mode_cfg.WAKEUPSRC[3] = lv_low_power_mode_cfg.WAKEUPINT[3] = 0UL;

    /* Wake up I/O sources */
    lv_low_power_mode_cfg.WAKEUPIOSRC = POWER_WakeUpIOCtrl(wakeup_io_ctrl);

    /* Enter low power mode */
    POWER_SetLowPowerMode(&lv_low_power_mode_cfg);

    /*** We'll reach this point ONLY and ONLY if the DEEPPOWERDOWN has not been taken (for instance because an RTC or
     * OSTIMER interrupt is pending) ***/
}

/**
 * @brief   Configures the 5 wake-up pins to wake up the part in DEEP-SLEEP and POWER-DOWN low power modes.
 * @param   wakeup_io_cfg_src : for all wake-up pins : indicates if the config is from IOCON or from PMC.
 * @param   wakeup_io_ctrl: the 5 wake-up pins configurations (see "LOWPOWER_WAKEUPIOSRC_*" #defines)

 * @return  Nothing
 *
 *          !!! IMPORTANT NOTES :
 *           1 - To be called just before POWER_EnterDeepSleep() or POWER_EnterPowerDown().
 */
/**
 * brief    PMC Deep Power-Down function call
 * return   nothing
 */
void POWER_SetWakeUpPins(uint32_t wakeup_io_cfg_src, uint32_t wakeup_io_ctrl)
{
    if (wakeup_io_cfg_src == LOWPOWER_WAKEUPIO_CFG_SRC_IOCON)
    {
        /* All wake-up pins controls are coming from IOCON */

        wakeup_io_ctrl = wakeup_io_ctrl | LOWPOWER_WAKEUPIO_PIO0_DISABLEPULLUPDOWN_MASK |
                         LOWPOWER_WAKEUPIO_PIO1_DISABLEPULLUPDOWN_MASK | LOWPOWER_WAKEUPIO_PIO2_DISABLEPULLUPDOWN_MASK |
                         LOWPOWER_WAKEUPIO_PIO3_DISABLEPULLUPDOWN_MASK |
                         LOWPOWER_WAKEUPIO_PIO4_DISABLEPULLUPDOWN_MASK; /* Make sure IOCON is not modified inside
                                                                           POWER_WakeUpIOCtrl */

        PMC->WAKEUPIOCTRL = POWER_WakeUpIOCtrl(wakeup_io_ctrl) & (~PMC_WAKEUPIOCTRL_WAKEUPIO_ENABLE_CTRL_MASK);
    }
    else
    {
        /* All wake-up pins controls are coming from PMC */
        PMC->WAKEUPIOCTRL = POWER_WakeUpIOCtrl(wakeup_io_ctrl) | PMC_WAKEUPIOCTRL_WAKEUPIO_ENABLE_CTRL_MASK;
    }

